const myFriend =("Маша");
console.log(myFriend);

//старий спосіб створення змінної через ключове слово vars
//test = 3;
//console.log(test);
//var test = 5;
//даний спосіб ми не використовуєм бо це старий синтаксис!!!

//-----------------------------------------------------------

//ми хочемо створювати більшість змінних через const
//значення зміних створених через const міняти не можемо
//при створинні такої зміної треба обов'язково присвоювати значення
//ми не можемо звернутися до змінної до її створення
//console.log(userName); - тут працювати не буде бо змінна userName вище не була створена

const userName = "Денис";
console.log(userName);
//userName = "Тарас" - працювати не буде бо ми хочемо змінити constant
//const userAge;
//працювати не буде бо ми не присвоїли змінній значення

//-----------------------------------------------------------

//змінні через ключове слово let ми створюємо тоді, коли певні що треба буде міняти значення в ній
//в змінних через let ми можемо міняти значення
//також змінні через let ми можемо створювати без присвоювання значення

let userAdress;
console.log(userAdress)
let userAge = "17";
console.log(userAge);
userAge = "18";
console.log(userAge);

